---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC.LipLength
source: html/feccf2ad-3b16-b3ca-5acb-cc4e6f122563.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralC.LipLength Property

Lip segment length.

## Syntax (C#)
```csharp
public double LipLength { get; set; }
```